In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\hp\appdata\roaming\python\python311\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.23.2 in c:\users\hp\appdata\roaming\python\python311\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\appdata\roaming\python\python311\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\appdata\roaming\python\python311\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\appdata\roaming\python\python311\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\hp\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.3 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [ ]:
import pandas as pd
import numpy as np
df=pd.Series({'A':[1,2,3],'B':[4,5,6]})
print(df)

A    [1, 2, 3]
B    [4, 5, 6]
dtype: object

In [4]:
import pandas as pd
df=pd.DataFrame({'A':[1,2,3],'B':[4,5,6]})
print(df)

   A  B
0  1  4
1  2  5
2  3  6

In [5]:
data=[10,20,30,40,50]
idex=['a','b','c','d','e']
pd.Series(data,index=idex)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [10]:
df=pd.read_csv('data.csv')
df.head(10)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North
5  2023-01-06        B   54.0  Product3  192.0   West
6  2023-01-07        A   16.0  Product1  936.0   East
7  2023-01-08        C   89.0  Product1  488.0   West
8  2023-01-09        C   37.0  Product3  772.0   West
9  2023-01-10        A   22.0  Product2  834.0   West

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      50 non-null     object
 1   Category  50 non-null     object
 2   Value     47 non-null     float64
 3   Product   50 non-null     object
 4   Sales     46 non-null     float64
 5   Region    50 non-null     object
dtypes: float64(2), object(4)
memory usage: 2.5+ KB

In [12]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [15]:
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [27]:
df.loc[0]

Date        2023-01-01
Category             A
Value             28.0
Product       Product1
Sales            754.0
Region            East
Name: 0, dtype: object

In [29]:
df.iloc[0][1]

C:\Users\HP\AppData\Local\Temp\ipykernel_13016\2309508539.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1]

'A'

In [25]:
df[df.isnull().any(axis=1)]

          Date Category  Value   Product  Sales Region
11  2023-01-12        B   60.0  Product2    NaN   West
15  2023-01-16        C    NaN  Product1  895.0  North
17  2023-01-18        C    NaN  Product1  108.0   West
28  2023-01-29        B    NaN  Product3  617.0  North
33  2023-02-03        C   27.0  Product3    NaN   East
35  2023-02-05        B   60.0  Product2    NaN   West
37  2023-02-07        C    2.0  Product1    NaN  North

In [44]:
df.at[11,'Value']

np.float64(60.0)

In [82]:
df[df['Value'].isnull()]

Empty DataFrame
Columns: [Date, Category, Value, Product, Sales, Region]
Index: []

In [55]:
df["Value"].fillna(df["Value"].mean(),inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_13016\63116692.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Value"].fillna(df["Value"].mean(),inplace=True)

In [56]:
df.isnull().sum()

Date        0
Category    0
Value       0
Product     0
Sales       4
Region      0
dtype: int64

In [57]:
df["Sales"].fillna(df["Sales"].mean(),inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_13016\1337033095.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Sales"].fillna(df["Sales"].mean(),inplace=True)

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      50 non-null     object
 1   Category  50 non-null     object
 2   Value     50 non-null     float64
 3   Product   50 non-null     object
 4   Sales     50 non-null     float64
 5   Region    50 non-null     object
dtypes: float64(2), object(4)
memory usage: 2.5+ KB

In [72]:
df['Date'] = pd.to_datetime(df['Date'], format='%Y-%m-%d')

In [77]:
df.dtypes

Date        datetime64[ns]
Category            object
Value              float64
Product             object
Sales              float64
Region              object
dtype: object

In [78]:
df.head()

        Date Category  Value   Product  Sales Region
0 2023-01-01        A   28.0  Product1  754.0   East
1 2023-01-02        B   39.0  Product3  110.0  North
2 2023-01-03        C   32.0  Product2  398.0   East
3 2023-01-04        B    8.0  Product1  522.0   East
4 2023-01-05        B   26.0  Product3  869.0  North

In [80]:
df.describe()

                      Date      Value       Sales
count                   50  50.000000   50.000000
mean   2023-01-25 12:00:00  51.744681  557.130435
min    2023-01-01 00:00:00   2.000000  108.000000
25%    2023-01-13 06:00:00  28.750000  356.000000
50%    2023-01-25 12:00:00  51.744681  578.000000
75%    2023-02-06 18:00:00  69.750000  749.750000
max    2023-02-19 00:00:00  99.000000  992.000000
std                    NaN  28.147185  263.151901

In [86]:
df["New Value"]=df['Value'].astype(int)

In [89]:
df.head()

        Date Category  Value   Product  Sales Region  New Value
0 2023-01-01        A   28.0  Product1  754.0   East         28
1 2023-01-02        B   39.0  Product3  110.0  North         39
2 2023-01-03        C   32.0  Product2  398.0   East         32
3 2023-01-04        B    8.0  Product1  522.0   East          8
4 2023-01-05        B   26.0  Product3  869.0  North         26

In [91]:
df["New Value"] = df['Value'].apply(lambda x:x*2)

In [93]:
df.head()

        Date Category  Value   Product  Sales Region  New Value
0 2023-01-01        A   28.0  Product1  754.0   East       56.0
1 2023-01-02        B   39.0  Product3  110.0  North       78.0
2 2023-01-03        C   32.0  Product2  398.0   East       64.0
3 2023-01-04        B    8.0  Product1  522.0   East       16.0
4 2023-01-05        B   26.0  Product3  869.0  North       52.0

In [98]:
df['Product'].unique()

array(['Product1', 'Product3', 'Product2'], dtype=object)

In [99]:
grouped_mean=df.groupby('Product')['Value'].mean()
print(grouped_mean)

Product
Product1    46.905585
Product2    52.800000
Product3    54.986562
Name: Value, dtype: float64

In [100]:
df.groupby(['Product','Category'])['Value'].sum()

Product   Category
Product1  A           234.000000
          B            36.000000
          C           480.489362
Product2  A           141.000000
          B           219.000000
          C           432.000000
Product3  A           302.000000
          B           414.744681
          C           328.000000
Name: Value, dtype: float64

In [102]:
##Aggregate multipule functions
df.groupby('Region')['Value'].agg(['mean','sum','count','max','min'])

             mean          sum  count   max   min
Region
East    42.307692   550.000000     13  97.0   8.0
North   40.226306   442.489362     11  71.0   2.0
South   62.000000   496.000000      8  94.0   6.0
West    61.041371  1098.744681     18  99.0  17.0

In [103]:
##Marge two dataframes
#creating two dataframes
df1=pd.DataFrame({'ID':[1,2,3],'Name':['Alice','Bob','Charlie']})
df2=pd.DataFrame({'ID':[1,2,3],'Age':[25,30,35]})

In [ ]:
pd.merge(df1,df2,on='ID') ##inner,outer,left,right join is possible how='inner'/'outer'/'left'/'right'

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35